test/artillery/import-pokemon.yml
config:
  target: "http://localhost:8081"
  phases:
    - duration: 2
      arrivalRate: 2
  plugins:
    publish-metrics:
      - type: "open-telemetry"
        serviceName: "artillery"
        metrics:
          reporter: otlp-http
          endpoint: "http://localhost:4318/v1/metrics"
          attributes:
            environment: "test"
            tool: "Artillery"
            type: "Load test"

        traces:
          reporter: otlp-http
          endpoint: "http://localhost:4318/v1/traces"
          attributes:
            environment: "test"
            tool: "Artillery"
            w3c.tracestate: "tracetest=true"
    tracetest:
      token: VLpIlEeSg
      definition: ./test/artillery/import-pokemon-definition.yml
      serverUrl: https://app.tracetest.io/
      runInfo:
        variables:
          - key: POKEMON_ID
            value: "88"
scenarios:
  - name: "Import Pokemon"
    flow:
      - post:
          url: "/pokemon/import"
          json:
            id: 88